results/test_maximum_write_iops/fio-100g-15.log
Starting FIO benchmark on pod 15...
FIO Configuration:
[global]
ioengine=libaio
direct=1
fallocate=none
#invalidate=1
size=10G
runtime=600
ramp_time=120
time_based=1
group_reporting=1
directory=/mnt/fio-data
numjobs=8
iodepth=16

refill_buffers=1
scramble_buffers=1
randrepeat=0
norandommap=1

[simple]
#rw=randrw
rw=randwrite
#rwmixread=70
bs=4k
---
simple: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
...
fio-3.41
Starting 8 processes
simple: Laying out IO file (1 file / 10240MiB)
simple: Laying out IO file (1 file / 10240MiB)
simple: Laying out IO file (1 file / 10240MiB)
[...]

simple: (groupid=0, jobs=8): err= 0: pid=76: Tue Mar 17 11:05:28 2026
  write: IOPS=7128, BW=27.8MiB/s (29.2MB/s)(16.3GiB/600044msec); 0 zone resets
    slat (nsec): min=1573, max=890485, avg=10372.93, stdev=3793.72
    clat (usec): min=992, max=372439, avg=17941.35, stdev=12950.97
     lat (usec): min=1003, max=372448, avg=17951.73, stdev=12951.00
    clat percentiles (msec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   10],
     | 30.00th=[   12], 40.00th=[   14], 50.00th=[   16], 60.00th=[   18],
     | 70.00th=[   21], 80.00th=[   24], 90.00th=[   29], 95.00th=[   34],
     | 99.00th=[   66], 99.50th=[  113], 99.90th=[  142], 99.95th=[  176],
     | 99.99th=[  230]
   bw (  KiB/s): min=16232, max=52528, per=100.00%, avg=28524.00, stdev=550.99, samples=9598
   iops        : min= 4058, max=13132, avg=7130.68, stdev=137.75, samples=9598
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.40%, 10=20.22%, 20=48.54%, 50=29.32%
  lat (msec)   : 100=0.91%, 250=0.60%, 500=0.01%
  cpu          : usr=0.53%, sys=1.49%, ctx=3745181, majf=0, minf=314
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,4277698,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=27.8MiB/s (29.2MB/s), 27.8MiB/s-27.8MiB/s (29.2MB/s-29.2MB/s), io=16.3GiB (17.5GB), run=600044-600044msec
FIO benchmark completed on pod 15